{
  "rec0nrDbKZrsszvvf": {
    "createdTime": "2025-06-27T14:27:38.000Z",
    "fields": {
      "Committee": "No",
      "Detailed Progress": "📅 Progress Timeline\n\n👥 Jun 24 – Team Formation \n\n- Franz (COO), Tea (CEO), Adhityan (CTO)\n\n\n🛠️ Aug 4 – Office Hours\n\n- Initial focus: validate credit scoring problem with banks + consumers\n\n- 59 bank contacts made, 1 showing interest\n\n- Consumer app launch targeted this month (goal: 1,000 early users)\n\n\n🎤 Aug 8 – Pitch\n\n- Open banking integration path established\n\n- Consumer app launched this weekend\n\n- 74 bank executives contacted; 2 meetings lined up\n\n- 3 LOIs signed\n\n\n🛠️ Aug 11 – Office Hours\n\n- Beta app launched with Tink (Visa) integration\n\n- 2 bank meetings secured\n\n- Fintech partner interested in year-long paid pilot (regardless of user base)\n\n- Microbank (CaixaBank subsidiary) identified as key target\n\n- Outreach expanded to 118 risk managers\n\n\n🎤 Aug 15 – Pitch\n\n- User app live, but traction metrics missing from pitch\n\n- Market size + AI benefits to banks not clearly presented\n\n\n🛠️ Aug 18 – Office Hours\n\n- Technical progress: app deployed on AWS, open banking integration functional\n\n- 3 LOIs still active, aiming for 5\n\n- Hottest lead: Austrian online bank via software partner\n\n- Preparing fintech pilot meeting in Barcelona\n\n\n🎤 Aug 22 – Pitch\n\n- Converted first LOI → paid pilot (€1.5K, potential €50K ARR)\n\n- Ongoing discussions with other banks\n\n- Meeting with Stéphane Boghossian to refine user acquisition strategy\n\n\n🛠️ Aug 25 – Co-Founder Conflict Meeting\n\n- Cofounder conflict emerged (communication breakdown, unclear roles)\n\nUrgent need for process fixes before IC\n\n\n🎤 Aug 29 – Pitch\n\n- 1 paid pilot signed, negotiating 2nd pilot\n\nFeedback (IC prep): must show differentiation vs bank algorithms + solid customer acquisition plan",
      "Detailed Progress old": "Jun 24: Team formed. Early focus on validating credit scoring problem with banks and consumers.\n\nAug 4: 59 bank contacts made, 1 showing interest. Product development: consumer app launch targeted this month with goal of 1,000 early users. Incorporation not yet completed, blocking paid pilots.\n\nAug 8: Open banking integration path established. Consumer app launched this weekend. 74 bank executives contacted; 2 meetings lined up. 3 LOIs signed.\n\nAug 11: Beta app launched with Tink (Visa) integration. 2 bank meetings secured. Fintech partner interested in year-long paid pilot regardless of user base. Identified Microbank (CaixaBank subsidiary) as key strategic target. Outreach expanded to 118 additional risk managers.\n\nAug 15: User app live, but traction metrics missing from pitch. Market size and AI benefits to banks not clearly presented.\n\nAug 18: Technical progress: app deployed on AWS, open banking integration functioning. 3 LOIs still active, aiming for 5. Hottest lead: Austrian online bank via software partner. Preparing fintech pilot meeting in Barcelona.\n\nAug 22: First LOI converted to paid pilot (€1.5K, potential to scale into €50K ARR). Continuing discussions with other banks. Meeting scheduled with Stéphane Boghossian to refine user acquisition strategy.\n\nAug 25: Cofounder conflict emerged (communication breakdown, unclear roles). Urgent need for process fixes before IC.\n\nAug 29: 1 paid pilot signed, negotiating 2nd pilot. Feedback from IC prep: need to show clear differentiation from existing bank algorithms and a solid customer acquisition plan.",
      "Full Notes (Office Hours + Friday Pitches)": "https://polar-scale-0bb.notion.site/ScoreTrue-25e1466f886f80bdbbe4d716438a29df?source=copy_link",
      "Industry": "FinTech",
      "Main SU 2025 (2)": "Franz Weber, Tea Vrcic",
      "Maxime's Comment": "PROS:\n- Highly experienced and diverse team with a strong network in the target market\n- Signed one paid pilot with lender\n- \"Hard\" market meaning defensible if acheived\nComplimentary skillsets\n\nCONS:\nInternal team issues (they solicited Pioneers to resolve a team issue)\nInexistant traction in their edge\nHard market: High regulations in market - long time to market\nGDPR potential issues\n\n\n",
      "Notes": "recO3uGhVagm8i5Yb,rec7IJgZSwS9QTn3N,recoybcQNTIy6KaEE,recJX341hap70RJJe",
      "Pitch Sequence": "4",
      "Previous Decks": "[object Object]",
      "Startup": "ScoreTrue (ex CreditPath)",
      "Startup Evaluation": "recsEJGHchszbN4xl,recTzde19uexEDdW0,recXZlL51J8LtAAAd,rec5VOXaMNET6OelY,rec3KgWGPbid6UPlk,recYkgOtuqQYZ7sQi,recivckjUB2upPWKN",
      "Startup in a word": "AI-powered user centric credit scoring solution\n(AI-powered app that uses Open Banking and behavioural data to help financial services assess and support young or ‘credit invisible’ users for fairer, more responsible lending)",
      "Team Members": "recwJxcDvm8e0gjn3,recZE4fXnvq3G58il,rec7BYeJHPUbDtD44",
      "Traction Summary": "🚀 Traction summary\n- 3 LOIs signed, 1 converted to paid pilot (€1.5K)\n- Beta app live with Tink (Visa) open banking integration\n\n✅ Customer Validation\n- Outreach to 100+ risk managers and bank executives (59 by Aug 4, 74+ by Aug 8, 118+ later)\n- Strategic discussions with Microbank (CaixaBank) and Austrian online bank\n\n🛠️ Product\n- Consumer app launched (Aug 8), beta live with AWS deployment and open banking integration\n- App includes credit scoring and AI-enhanced features for banks\n- Traction metrics from users not yet demonstrated\n\n📌 Other\n- Strong cofounder conflict (communication breakdown, unclear roles)\n- Feedback: clarify differentiation from existing bank algorithms and improve customer acquisition strategy",
      "Traction Summary old": "3 LOIs, 1 converted to paid pilot (€1.5K, potential €50K ARR), beta app live with open banking integration, 74+ bank execs contacted, pipeline expanding.",
      "Weekly forms": "recUNhU3V5wxLycfl,recYTxfhbpCfyt5kI,recVhtmHQ4QhCuLGF,recW722fHA8oht4aM,recIJWgbCQmUzyMX4,recQ7WJ8nUdsOUkm0,recDoHZikvedxRwLT"
    }
  },
  "rec13EhdLNCFApcPb": {
    "createdTime": "2025-06-27T14:27:48.000Z",
    "fields": {
      "Active / inactive": "dead",
      "Main SU 2025 (2)": "Amit Sinha, Tomas Jenicek",
      "Notes": "rec82LkRtCvLJ0kdj,recNaCyR1CGogQPXw,recAggx6rC3lKA0uB",
      "Startup": "PulseAI",
      "Startup in a word": "AI agent for proactive application health monitoring that helps you detect issues before they impact the users and helps you quickly fix them - https://www.spil.dev/",
      "Team Members": "recSt2IAYyrlpGH9W,rec2aL3QZfZ0jZ7bW",
      "Weekly forms": "recNpUH1CFWyWyr5M,recS7AdQadqiArHpN"
    }
  },
  "rec3zysTAj0wZsqXa": {
    "createdTime": "2025-06-27T14:27:01.000Z",
    "fields": {
      "Active / inactive": "active",
      "Committee": "Go",
      "Detailed Progress": "📅 Progress Timeline\n\n👥 Jun 23 – Team Formation\n\nZac (COO), Jules (CEO), Tomas (CTO just decided to leave on September 3!)\n\n\n🛠️ Aug 5 – Office Hours\n\n- Customer discovery: ~100 cold calls, 15 logistics companies engaged (5 large, 10 SMEs)\n\n- Prospects: FM Logistic, Andros, XPO, Group Rota\n\n- 2 staffing agencies committed as contract partners\n\n- Marketplace model validated with 50% margin on full-service (supply + demand)\n\n- Goal: first transactions by end of month\n\n\n🎤 Aug 8 – Pitch\n\n- Position: Unified database for blue-collar workers\n\n- MVP: predicting no-shows + real-time worker replacement\n\n- Case study: logistics company with 30% no-shows costing €2M/year\n\n\n🎤 Aug 15 – Pitch\n\n- Reframed as AI hiring system for staffing agencies\n\n- Value: reducing placement time from days → minutes with sourcing + matching automation\n\n- Progress: traction in France, but struggling in US (cold calls harder)\n\n- Feedback: solution too broad, problem statement generic, urged to focus on France first\n\n- Target: design partners next week, paying customers by end of summer\n\n\n🎤 Aug 22 – Pitch\n\n- Solution: AI conversational agent messaging workers in parallel, automating agency workflows\n\n- Market: €200B staffing, focusing on €22B temp staffing segment\n\n- Progress: 2 design partners signed, MVP ready, aiming for 2 more + first paying customers\n\n- Feedback: clarify terminology (“talent pool” vs AI agent)\n\n\n🎤 Aug 29 – Pitch\n\n- Position: AI recruiter automating candidate search/outreach (4 hours → minutes)\n\n- Traction: new design partner signed, 25 customers contacted, pipeline of 1000 agencies identified\n\nFeedback (Salomon):\n• Strong presentation\n• Market is crowded → stronger traction needed before VC funding\n\n🎤 Sep 8 – Pre-IC\n\n- Traction: 4 design partners signed, €38k revenue pipeline\n\n- Market: €200B global staffing, €42B in France\n\n- Model: Hybrid approach (AI tool + database ownership + full agency services)\n\n- Strategy: focus on small agency partnerships to gain traction, validate in Europe before US expansion\n\n- Vision: long-term plan to own worker database and provide end-to-end staffing solutions",
      "Detailed Progress old": "Jun 23: Team formed. Early team changes — Gabriel left, Arthur joined from another team. Current structure: Zac (CEO/sales), Tomas (CTO – PhD ML), Arthur (product), Jules (CEO role testing). Still aligning on roles, no equity agreements yet. Strong early impression but later flagged for lack of quantified customer learnings.\n\nAug 5: Office hours. Customer discovery: ~100 cold calls, 15 logistics companies engaged (5 large, 10 SMEs). Prospects include FM Logistic, Andros, XPO, Group Rota. Two staffing agencies committed as contract partners. Marketplace model with 50% margin on full-service (supply + demand) validated. Goal: first transactions by end of month. YC application submitted.\n\nAug 8: Pitch. Positioned as unified database for blue-collar workers. MVP: predicting no-shows and real-time worker replacement. Highlighted logistics case study (30% no-shows costing €2M/year). US market focus announced (San Francisco launch).\n\nAug 15: Pitch. Reframed as AI hiring system for staffing agencies. Value: reducing placement time from days to minutes by automating sourcing and matching. Progress: traction in France, struggling to break into US (harder cold calling). Feedback: solution too broad, problem statement generic, urged to focus on France first. Target: design partners next week, paying customers by end of summer.\n\nAug 22: Pitch. Team reframed as Zac (4 years logistics/hiring), Jules (VC/startup), plus technical builder. Solution: AI conversational agent messaging workers in parallel, automating agency workflows. Market: €200B staffing, targeting €22B temp staffing. Progress: 2 design partners signed, MVP ready, aiming for 2 more + first paying customers. Feedback: clarify terminology (“talent pool” vs AI agent).\n\nAug 29: Pitch. Positioned as AI recruiter automating candidate search/outreach (4 hours → minutes). Traction: new design partner signed, 25 potential customers contacted, pipeline of 1000 agencies identified. Feedback from Salomon: good presentation, but crowded market — will need stronger traction before VC funding; offered introductions to Xfiner (acquired by Randstad).",
      "Full Notes (Office Hours + Friday Pitches)": "https://polar-scale-0bb.notion.site/JooobAI-25e1466f886f80f1ae7ff030e2741ab6?source=copy_link",
      "Industry": "HR Tech",
      "Main SU 2025 (2)": "Gabriel Duciel, Jules Ferrer, Zaccarie Morel",
      "Maxime's Comment": "PROS:\n\nTEAM:\nThe 2 founders (Zack and Jules) have complementary personalities and are very aligned in their vision and way of working. \nThey also present well and are outspoken. \nZac has strong experience with Blue-collar workers in his previous experience. (he's the ex-COO of Bold, and founder of La Tournée)\n\nEXECUTION:\nDuring the program they showed a good capacity to question themselves and their positioning. (They have pivoted on their solution 3-4 times)\nWithin the program: they closed a design partnership with a big interim company with a annual contract value of 25k EUR.\n\nCONS:\n\nTEAM:\nLost 2 CTO -cofounders during the program, which is an \"orange\" flag in their capacity to attract and keep strong talent.\n\nEXECUTION:\nPivoted too many times which shows a lack of market clarity which resulted in not shipping any product during the program.\n\nMARKET:\nTheir new positioning (Full-stack AI-agency play) might hinder their chances of subsequent VC funding due to challenging scalability.\n\n",
      "Notes": "recIccCu5wosd8th7,recIET00Q3aRYlaK0,recRWwJPaOeoXWc3e,recY4xjVRpX2gpvM6,recxtEP6IbYKC1W98",
      "Pitch Sequence": "1",
      "Previous Decks": "[object Object]",
      "Startup": "JooobAI",
      "Startup Evaluation": "recqukM3WngnhaTDl,recoqZ5MLZV5EhAci,recPHIVPyC4z5965J,recYtSg3YJjWEcZDk,recnRTdk2x93ilPrz,rec6O54nH4T4KBwfL",
      "Startup in a word": "Enabling staffing agencies to hire the best workers, faster.",
      "Team Members": "rec1mGcDGgMvv2pxX,recFBRePgXKkiq5r6,rec2aL3QZfZ0jZ7bW",
      "Traction Summary": "🚀 Traction summary\n- 4 design partners signed (staffing agencies)\n- €38k revenue pipeline confirmed\n- 25+ potential customers contacted; pipeline of 1,000 agencies identified\n- MVP ready, targeting first paying customers\n\n✅ Customer Validation\n- 100 cold calls, 15 logistics companies engaged\n\n🛠️ Product\n- conversational agent, predicts no-shows, massively reducing placement time\n\n📌 Other\n- €200B global staffing market, €42B in France\n- Feedback: focus on France before US\n- Market crowded – stronger traction needed before expansion\n- Long-term vision: own worker database, provide end-to-end staffing solutions",
      "Traction Summary old": "2 design partners signed, 1 new partner added Aug 29, 25+ potential customers contacted, MVP ready, aiming for first paying customers.",
      "Weekly forms": "reciEmSPpX19p4O4W,rec7Q18CUleSiv0ZF,receyN0QLPLORVgbE,recnTiKFXiWxUG0Rd,recloRhKq7eVCG3kI,rec0zB6wg2eGeXTpx"
    }
  },
  "rec8M6MPGZEYaZ3rf": {
    "createdTime": "2025-07-22T14:02:29.000Z",
    "fields": {
      "Active / inactive": "active",
      "Committee": "Go",
      "Detailed Progress": "📅 Progress Timeline\n\n👥 Jul 17 – Team Formation\n\n- Leon: 5 years GovTech experience, ex-VC-backed startup\n- Alex: Strong tech background\n\n- Opportunity: sales intelligence for tech companies targeting German public sector\n\n- Validation: 15 customer interviews → narrowed to foreign tech companies with small German public sector teams\n\n\n🛠️ Aug 6 – Office Hours\n\n- Demo prepared for CrowdStrike, 3–4 hot leads identified\n\n- Recommendation: charge €200–500 for design partnerships to ensure commitment\n\n- Market assessment: GovTech tough but moat-building if cracked\n\n- Risk: little visible traction yet\n\n\n🎤 Aug 8 – Pitch\n\n- Position: AI-enabled Bloomberg Terminal for procurement\n\n- Demo functional, data extraction working\n\n- Progress: first paid LOI secured (€250/month), 3 more pilots in pipeline\n\n\n🎤 Aug 15 – Pitch\n\n- Progress: signed first paid pilot (€300/6 weeks) + 2 LOIs\n\n- AWS flagged as key account (50–60 person public sector team)\n\n- Feedback: need clearer market size, sharper solution definition, compelling win stories\n\n\n🎤 Aug 22 – Pitch\n\n- Refined position: public sector sales intelligence platform\n\n- Market: 10,000 companies selling to German gov (~€200M), expandable to €105B Europe\n\n- Progress: 2 LOIs pending, more demos ongoing\n\n- Feedback: slides too problem-heavy (50%), team’s data-processing expertise underplayed, market sizing visuals confusing\n\n\n🎤 Aug 29 – Pitch\n\n- Progress: paid pilot with CrowdStrike completed\n\n- Position: entity profiling + early signal detection for public sector sales\n\n- Next milestone: industry fair (20K visitors)\n\n- Feedback (Salomon): strong concept, but needs clearer GTM, stronger gov navigation expertise, and focus on high ACV contracts (limited customer base)\n\n\n🎤 Sep 8 – Pre-IC Pitch\n\n- Position: AI-powered early signals for government tender opportunities\n\n- Market: €180M addressable market in Germany, 500+ accessible accounts\n\n- Traction: pilot customer CrowdStrike, €20–25K ARR per account, targeting €200K ARR in Germany before expanding to Europe\n\n- Team: strong background in government and data infrastructure\n\n- Feedback:\n• Realistic ARR targets, but needs sharper clarity on market size and competitive differentiation\n• Scaling via international companies with dedicated public sector sales teams",
      "Detailed Progress old": "Jul 17: Team formed. Leon brings 5 years GovTech experience (previous VC-backed startup). Identified opportunity in sales intelligence for tech companies targeting German public sector. Initial validation: 15 customer interviews, focus narrowed to foreign tech companies (AWS, Palo Alto, CrowdStrike) with small German public sector teams.\n\nAug 6: Office hours. Demo prepared for CrowdStrike, 3–4 hot leads identified. Recommendation: charge €200–500 for design partnerships to ensure commitment. Market assessment: GovTech hard but moat-building if cracked. Execution risk: little visible traction yet.\n\nAug 8: Pitch. Positioned as AI-enabled Bloomberg Terminal for procurement. Demo functional, data extraction working. First paid LOI secured (€250/month), with 3 more pilots in pipeline.\n\nAug 15: Pitch. Signed first paid pilot (€300 for 6 weeks) + 2 additional LOIs. AWS identified as major account (50–60 person public sector team). Feedback: must show market size more clearly, sharpen solution definition, and craft compelling win stories.\n\nAug 22: Pitch. Refined to public sector sales intelligence platform. Market framed as 10,000 companies selling to German government (€200M), expandable to €105B Europe. Progress: 2 LOIs pending, more demos ongoing. Feedback: slides too focused on problem (half presentation), team’s data-processing expertise underplayed, market sizing visuals confusing.\n\nAug 29: Pitch. Completed paid pilot with CrowdStrike. Positioned as entity-profiling and early signal detection tool for public sector sales. Upcoming industry fair (20k visitors) seen as major opportunity. Feedback from Salomon: strong concept, but needs clearer GTM strategy, stronger government navigation expertise, and focus on high ACV contracts (limited number of customers).",
      "Full Notes (Office Hours + Friday Pitches)": "https://polar-scale-0bb.notion.site/GovIntel-25e1466f886f809d8373eb8a6863457b?source=copy_link",
      "Industry": "GovTech",
      "Maxime's Comment": "PROS:\n\nTEAM:\nThe CEO has a strong and rare sector knowledge that can be a strong defensibility point. Leon (CEO) worked for the German government as a Parlimentary Assistant and as an associate in a German Federal Office.  \n\nEXECUTION:\nThe team has gotten their first paid pilot in mid-August (notoriously known to be hard) with entreprise client (Crowdstrike).\nThey've already shipped first version of the product within 1 month of building. \n\nCONS:\n\nTEAM:\nThe CEO has an introvert personality and is not the most charismatic, which might affect their capacity to close deals.\n\nMARKET:\nThe market complexity:\n- Country-specific - hard for scaling (However, the data sources are European).\n- Can be considered niche.\n",
      "Notes": "rec4MjqfPrk44s6bG",
      "Pitch Sequence": "3",
      "Previous Decks": "[object Object]",
      "Startup": "GovIntel",
      "Startup Evaluation": "recdUR86j8OipVGxs,recqNsLskUZLFPq9K,recLyHM5nRFKpngnW,reclL7CWmv7TVSp2e,rec0Tq6UTh8oTlujH,recDA8ORN7qvfX1qO,rechg0DXpUkGIgSBz",
      "Startup in a word": "Market intelligence for B2G sales",
      "Team Members": "reclrnvOhKD5lwtIL,recekH0WQAEMk26vc",
      "Traction Summary": "🚀 Traction summary\n- 1 paid pilot completed with CrowdStrike (€300 / 6 weeks)\n- 2 LOIs signed, 3–4 hot leads in pipeline\n- €180M addressable market in Germany (500+ accessible accounts)\n- €20–25K average ARR per account, targeting €200K ARR in Germany before European expansion\n\n✅ Customer Validation\n- 15 customer interviews with foreign tech companies targeting German public sector\n- First paid pilot confirms willingness to pay\n\n🛠️ Product\n- AI-enabled sales intelligence platform (“Bloomberg Terminal for procurement”)\n- Features: entity profiling and early signal detection for public sector sales\n- Demo functional with data extraction working\n\n📌 Other\n- Strong founder background in government and data infrastructure\n- Feedback: improve clarity on market size and differentiation\n- Scaling strategy: expand from German focus to broader European market via international tech companies",
      "Traction Summary old": "First paid pilot (€300/6 weeks) completed with CrowdStrike, 2 LOIs signed, 3–4 hot leads in pipeline, preparing industry fair with 20k visitors.",
      "Weekly forms": "recbPImOecALehPXS,rec5ISWJMQZXUCRJM,recVWFwwlRvPKOk6p,recxkSQW2z6FsGCpk,recNbLJmulJrw8xyD,recVLrw5xIKfEM0Ht,recDbHXBIeh1rG6Bh"
    }
  },
  "recEBMmGuZY967b1s": {
    "createdTime": "2025-07-17T10:57:26.000Z",
    "fields": {
      "Active / inactive": "dead",
      "Notes": "recrnqOglq1T91WYq",
      "Startup": "PulseOps",
      "Startup in a word": "Handing operational issues so you don't have to\n\nField management voice AI Agent to handle equipment breakdown and more multi-site businesses",
      "Team Members": "rec2cIF9tr7DRPBKK,recopl8BiPUxhnPh6",
      "Weekly forms": "rec6Ng7GrOy8iXYVE"
    }
  },
  "recFe6iiMcUH8fyz2": {
    "createdTime": "2025-06-27T14:27:58.000Z",
    "fields": {
      "Active / inactive": "Selection Day No Go",
      "Main SU 2025 (2)": "André Kaminker, Leo Thevenet",
      "Notes": "rec59iL2zQT6r0ZnK,recTynWhweKWNQZ4D,recYfP4weAZxwruMv,recaX3BWer5Y51p5f",
      "Pitch Sequence": "18",
      "Previous Decks": "[object Object]",
      "Startup": "Mirae (ex Smartfluence)",
      "Startup Evaluation": "reclS9K1XqonqpEjD,recf3HrasSZwbXLIG,recLI3p18l1DAH3ym,recgoc4rEthoSGTXj",
      "Startup in a word": "Matching brands with the perfect influencers, and let them delegate the management",
      "Team Members": "rech64xasAwEhaY39,rec4OQFf0dpglgdZe,reclWyXXWkmLtU04X",
      "Weekly forms": "recZV7ggoR1mVBbgb,rec6GQC3RZ0njtwGm,recini2leifaT9oHE,recTmRYVmzh5MObWO"
    }
  },
  "recFfOxGTpT6TlvuK": {
    "createdTime": "2025-09-04T15:47:48.000Z",
    "fields": {
      "Industry": "Social Tech",
      "Previous Decks": "[object Object]",
      "Startup": "Ooma",
      "Startup in a word": "Social AI lab focusing on building Ted - the first AI teddy bear companion you can share with your friends.\n\n",
      "Team Members": "rec58x43yKZqSBn3p,recPP4DWVlVSkw01S"
    }
  },
  "recFkAsakwmENY1wZ": {
    "createdTime": "2025-09-04T15:46:28.000Z",
    "fields": {
      "Startup": "Ooma",
      "Team Members": "recPP4DWVlVSkw01S,rec58x43yKZqSBn3p"
    }
  },
  "recHRVTq6tvZydMj9": {
    "createdTime": "2025-07-17T10:53:41.000Z",
    "fields": {
      "Active / inactive": "Selection Day No Go",
      "Notes": "recPue2hbOl55pSpF",
      "Pitch Sequence": "14",
      "Previous Decks": "[object Object]",
      "Startup": "Unvested - NAIA",
      "Startup Evaluation": "rechuSUtqOgAlldbR,recWbRHsrEXXhVqh4,recpGMVg4TRKBbMUP,recMvfH19ESGGzPqo,recPcE03BsAg0XeFe",
      "Startup in a word": "Automated savings and investments for financial empowerments",
      "Team Members": "recHBTI1ypAieclDf,recpGtzPPZKDJhBHM",
      "Weekly forms": "rec6lH12TiCCYI0WX,rec2ric6iEaNI7xhS,rectZfgxSsWrzncvt"
    }
  },
  "recKRtBD0ycC8lZGx": {
    "createdTime": "2025-07-28T13:23:24.000Z",
    "fields": {
      "Active / inactive": "active",
      "Committee": "Go",
      "Detailed Progress": "📅 Progress Timeline\n\n👥 Jul 25 – Team Formation\n\nPierre - Google B2B sales)\nPascal - Google product strategy\n\n- Vision: AI nutrition/chatbot app via B2B2C gym/pharmacy partnerships\n\n\n🛠️ Aug 4 – Office Hours\n\nEarly traction:\n• Fitness Park (1M members, launch Sept/Oct)\n• Groupe Mirage (26 Paris gyms acquired)\n• Decathlon (CMO contact, exploring freemium)\n\n- Goal: deploy in 500 Fitness Park gyms by Jan 2026 (starting with 50–100 pilot gyms)\n\n- Alpha app ready: nutrition tracking, macro updates, personalized coaching\n\n- Beta launch targeted for Sept\n\n- Risk: dependency on external dev agency (5% equity deal)\n\n\n🎤 Aug 8 – Pitch\n\n- Positioned as 24/7 nutritional chatbot\n\n- Validation: 126K Twitter views, influencer support\n\n- Dev challenge: GPT-4 API vs ChatGPT speed issues\n\n- B2B traction: meetings with Fitness Park, Decathlon, Newness, Basic Fit, Episode, Alan (insurance wellness)\n\n- Launch target: mid-Sept (uncertain for pre-IC)\n\n\n🛠️ Aug 11 – Office Hours\n\n- Roadmap for 0–3 months with sales projections\n\n- Product validated at base level, but UX not yet commercial\n\n- Demo dilemma: show infra vs mock-ups\n\n- Equity deal with agency considered too risky → alternatives: BPI grants, angels, freelancers\n\n- Funding target: €80–100K to build v1 without long-term equity dilution\n\n\n🎤 Aug 15 – Pitch\n\n- Position: AI nutrition companion via B2B2C gyms/pharmacies\n\n- Secured 4 soft partnership commitments\n\n- MVP due end of Aug, beta Sept\n\n- Feedback: strong potential, but avoid risky equity deal\n\n\n🎤 Aug 22 – Pitch\n\n- Problem framed: global weight-loss failure rates (95%)\n\n- Market: €5B nutrition apps, €15B fitness/wellness\n\n- Progress: top 5 gym networks engaged (covering 40% of market), alpha release end of week\n\n- Feedback: too much time on problem/solution → need more traction + distribution focus\n\n\n🎤 Aug 29 – Pitch\n\n- Progress: 7 gym networks engaged, 2 agreed commercialization rollout\n\n- Market approach: target 75% of French gym-goers (~€2.5–5M ARR potential)\n\n- Feedback (Salomon): hot market but crowded; must prove gym acquisition execution + viral loops before IC\n\n🎤 Sep 8 – Pre-IC Pitch\n\n- Position: AI-powered nutrition app with gym network partnerships\n\n- Traction: partnerships with 7 top French gym brands (covering 75% of market, 4.5M users)\n\n- 2 pilot agreements signed with Fitness Park and Basic Fit (launch Oct/Nov)\n\n- Product: alpha complete, beta launch delayed ~1.5 months, targeting Sept user acquisition\n\n- Innovation: exploring smart glasses integration for frictionless food logging\n\nFeedback:\n• Market strategy solid (B2B2C focus), but must validate execution at scale\n• Needs sharper viral growth mechanics and clear distribution roadmap",
      "Detailed Progress old": "Jul 25: Team formed (Pierre – Google B2B sales, Pascal – Google product strategy). Focus: AI nutrition/chatbot app for fitness and nutrition coaching, using B2B2C partnerships with gyms/pharmacies.\n\nAug 4: Early traction with major players: Fitness Park (1M members, launch Sept/Oct), Groupe Mirage (26 Paris gyms acquired), Decathlon (contact with CMO, exploring freemium model). Goal: deploy in 500 Fitness Park gyms by Jan 2026, starting with 50–100 pilot gyms. Alpha app ready with nutrition tracking, macro updates, and personalized coaching; beta launch targeted for Sept. Risks flagged around dependency on external development agency (5% equity deal).\n\nAug 8: Pitch. Positioned as 24/7 nutritional chatbot. Market validation: 126K Twitter views, influencer support. Development challenges: GPT-4 API vs ChatGPT speed issues. B2B traction: meetings with Fitness Park, Decathlon, Newness, Basic Fit, Episode, and Alan (insurance) for wellness partnership. Launch target: mid-Sept (uncertain for pre-IC).\n\nAug 11: Office hours. Roadmap created for 0–3 months with sales projections. Product: base validated, but UX not yet commercial. Discussed demo dilemma (show infra vs mock-ups). Equity deal with agency considered too risky; alternatives identified (BPI grants, angels, freelancers). Target: €80–100k to fund first version without long-term equity loss.\n\nAug 15: Pitch. Positioned as AI nutrition companion with B2B2C via gyms/pharmacies. 4 soft partnership commitments secured. MVP due end of August, beta Sept. Feedback: strong potential but must avoid risky agency equity deal.\n\nAug 22: Pitch. Problem framed as global weight-loss failure rates (95%). Market: €5B nutrition apps, €15B fitness/wellness. Progress: engaged top 5 gym networks covering 40% of market, alpha version releasing end of week. Feedback: too much time on problem/solution, needs more focus on traction and distribution.\n\nAug 29: Pitch. Progress: 7 gym networks engaged, 2 agreed to commercialization rollout. Market approach: target 75% of French gym-goers (~€2.5–5M ARR potential). Feedback from Salomon: hot market, but crowded. Need proof of gym acquisition execution and viral loops before IC.",
      "Full Notes (Office Hours + Friday Pitches)": "https://polar-scale-0bb.notion.site/FitBot-25e1466f886f80be853bc8e764b6cd42?source=copy_link",
      "Industry": "Health/Fitness",
      "Maxime's Comment": "PROS:\n\nTEAM:\nQuality team background (ex-Google employees having worked on consumer-facing products)\nCharismatic CEO\n\nTRACTION:\nGood Sales traction and momentum: Within 6 weeks, they managed to be in advanced discussions with 6-7 gym networks representing +/- 4.5m users (thereof one commitment from BasicFit) and 2 influencers with +4m users.\n\nCONS:\n\nTEAM:\nCTO is not full-stack - doesn't ship very fast which resulted in first launch only after 2 months of developing (Product execution risk).\n\nMARKET:\nLow potential defensibility (although working on blood sampling).\nRed Ocean market with many players.\n",
      "Pitch Sequence": "6",
      "Previous Decks": "[object Object]",
      "Startup": "FitBot",
      "Startup Evaluation": "recDss9t5rEtDVQDk,recsK0uSjmPcRorrb,recPPhj6xVBcKlkU7,recNrL6rsIy6nXTUw,recG0fqAeGH1rRR7U,recYN5SwcskO5V7QU,recKrAZKQQMN1R6tT",
      "Startup in a word": "An AI powered nutritional coach.",
      "Team Members": "recBYVUtmSAJHlKvj,recLtXbVaCYn2bRqU",
      "Traction Summary": "🚀 Traction summary\n- Partnerships with 7 top French gym brands (covering 75% of market, ~4.5M users)\n- 2 pilot agreements signed with Fitness Park and Basic Fit (launch Oct/Nov)\n- Beta launch pushed ~1.5 months, now targeting September for user acquisition\n- Exploring smart glasses integration for effortless food logging\n\n✅ Customer Validation\n- Early commitments from 4+ gym/pharmacy partners \n- Goal: deploy in 500 Fitness Park gyms by Jan 2026 (pilot 50–100 gyms first)\n\n🛠️ Product\n- AI-powered nutrition/chatbot companion with macro tracking, personalized coaching, and API integrations\n- Beta launch planned for September\n- Exploring smart glasses integration to improve frictionless logging\n- Development risk: dependency on external agency (5% equity deal) → exploring alternatives (BPI grants, angels, freelancers)\n\n📌 Other\n- Market hot but crowded - proof of execution and viral loops required \n",
      "Traction Summary old": "Engaged with 7 gym networks (2 agreed to commercialization), Fitness Park (1M members) launch Sept/Oct, Alpha ready end Aug, targeting €2.5–5M ARR via B2B2C.",
      "Weekly forms": "rec9PLDJkCwlRjNZL,recMP62iQjk2TvDuw,recLcOKNoLsQNWYtT,recqTFCHYYpJa3J68,recLcxKivBgCHBwtF,recYG6VqGkSMLLNVX"
    }
  },
  "recLJZjnmwep93fmB": {
    "createdTime": "2025-06-27T14:27:01.000Z",
    "fields": {
      "Active / inactive": "active",
      "Committee": "Go",
      "Detailed Progress": "📅 Progress Timeline\n\n\n👥 Jun 18 – Team Formation\n\n- Connor - backend, Jonathan - frontend, Clément - CRO, Stéphane - CEO\n\n- Started in HR process optimization → pivoted to hiring/sourcing solutions after 100+ interviews\n\n\n🛠️ Aug 5 - Office Hours\n\n- Pivot confirmed: focus on hiring specialization\n- Pricing models tested:\n• €300 for 2-week sprint (with €200 deposit)\n• €70/seat subscription\n\n- Goal: 10 paying customers pre-product\n\n- Early interest: HubSpot, Sorare, Salesforce, Klaviyo (no paying clients yet)\n\n- Strategy: Target CEOs directly (decision-making power + budget)\n\n\n🎤 Aug 8 – Pitch\n\n- Position: Automated headhunting via LinkedIn founder networks\n\n- Early proof: Sorare engaged, payment pending\n\n- MVP manual delivery while building tech\n- Goal: 500 outreach/week → 20 meetings → 10 new clients\n\n\n🎤 Aug 15 – Pitch\n\n- Reported first 2 paying customers (€1K/year each)\n- Conversion funnel: 20 requests → 14 accepts → 4 replies → 1 hire\n\nFeedback:\n• Avoid small automation tool comparisons (Waalaxy, PhantomBuster)\n• Emphasize big vision for CEO recruiting transformation\n\n- Target: 140 customers by cohort end\n\n\n🎤 Aug 22 – Pitch\n\n- Refined positioning: “Recruiting platform using founders network” for Series A/B founders. New positioning: https://umamy.io/ \n\n- Delivers 20–30 warm leads/month with 30%+ reply rates (3x industry avg)\n\n- MVP built, early clients migrating to product\n\n- Market framed as €1.5–2M ARR with 100 clients\n\nFeedback:\n• Tagline too vague\n• Problem section too long\n• Solution slide should show concrete mechanics\n\n\n🎤 Aug 29 – Pitch\n\n- Current traction: 5 paying customers, €6K ARR\n\n- MVP: LinkedIn AI agent → 160 conversations/month, 65% reply rate\n\n- Slack workflow integration live\n\nPricing: €199/month\nTarget: €190K ARR by mid-Sept\n\nFeedback (Salomon):\n• Website strong, needs demo video\n• Must address retention/churn + HR tool integrations (Personio, HiBob)\n\n🎤 Sep 8 – Pre-IC Pitch\n\n- Position: LinkedIn headhunting automation for founders\n\n- Traction: 5 paying customers in France/US, €109/month pricing\n\n- Sales: short cycle (within 1 week), 1/3 outbound conversion rate\n\n- Team: 15+ years combined experience at Google, Salesforce\n\n- Target: €200k ARR by year-end\n\nFeedback:\n• Strong differentiation from proprietary data generated in conversations\n• Early traction mostly from personal networks – needs outbound expansion plan",
      "Detailed Progress old": "Jun 18: Team formed. Early energy strong, good complementarity (Connor – backend, Jonathan – frontend, Clément – CRO, Stéphane – CEO). Started in HR process optimization, but after 100+ customer interviews pivoted toward hiring/sourcing solutions. Initial traction slowed during July (personal factors + pivot).\n\nAug 5: Office hours. Pivoted to hiring specialization. Introduced two pricing models (€300 2-week sprint with €200 deposit; €70/seat subscription). Goal: 10 paying customers pre-product. Early interest from HubSpot, Sorare, Salesforce, Klaviyo. No paying clients yet. Targeting CEOs directly instead of HR (decision-making power + budget).\n\nAug 8: Pitch. Positioned as automated headhunting via LinkedIn founder networks. Early proof: Sorare engaged, payment pending; more clients expected post-vacation. MVP delivered manually while building tech. Goal: 500 outreach/week, 20 meetings, 10 new clients.\n\nAug 15: Pitch. Reported first 2 paying customers (€1K/year each). Conversion funnel example: 20 requests → 14 accepts → 4 replies → 1 hire. Feedback: avoid comparisons with small automation tools (Waalaxy, PhantomBuster), instead show bigger vision for CEO recruiting transformation. Target: 140 customers by cohort end.\n\nAug 22: Pitch. Refined solution: “Always-on recruiting OS” for Series A/B founders, providing 20–30 warm leads monthly with 30%+ reply rates (3x industry). MVP built; migration of early clients to product scheduled. Market framed as €1.5–2M ARR with 100 clients. Feedback: tagline too vague (“recruiting OS”), problem section too long, solution slide should show concrete product mechanics.\n\nAug 29: Pitch. Progress: 5 paying customers, €6K ARR. MVP deployed as LinkedIn AI agent generating 160 conversations/month, 65% reply rate, Slack integration for workflow. Pricing: €199/month. Target: €190K ARR by mid-Sept. Feedback from Salomon: strong website, but needs demo video; must focus on retention/churn and HR tool integrations (e.g. Personio, HiBob) to be credible at scale.",
      "Full Notes (Office Hours + Friday Pitches)": "https://polar-scale-0bb.notion.site/Umamy-25e1466f886f80e5a53be92909bce7de?source=copy_link",
      "Industry": "HR Tech",
      "Main SU 2025 (2)": "Connor Blair, Stéphane Millet",
      "Maxime's Comment": "PROS:\n\nTEAM:\nCEO is a repeat-entrepreneur: Stephane has launched several companies with respectable outcomes (million+ revenues and several small exits)\nThey have a complimentary team.\n\nEXECUTION:\nThey pivoted several times in the HR space and have now found a somewhat convincing/differentiated entry point.\nStrong sales capacity: within 2 months they managed to sign several \"high-profile\" tech scaleups already such as Sorare and Timeleft.\n\nCONS:\n\nTEAM:\n- CEO just had a baby and is based is now based in Biarritz, they will be working remotely half of the time.\n- Team is too big for an early stage company (4 members including a head of Sales/CSO), CEO seems to act sometimes as a manager rather than a founder.\n\nMARKET:\n- HR market is notoriously hard as it's a red ocean.",
      "Notes": "recp4VX5jkk6MIDpL,recAhu1LuDUeZ2wVP,rec2oeedaGV47nzWX,rec6gTRpRLFsrI45S",
      "Pitch Sequence": "2",
      "Previous Decks": "[object Object]",
      "Startup": "Umamy",
      "Startup Evaluation": "recZjyjC0x7YpxdnM,rec7lPIypKfRO7YAv,recMbAil3bbf3oc8e,rec9UySdRCktvWAJU,rec2rgTJR4Vj0YHeA,recc7KAHbeiWGUgfp,recwMzjwlby7PRxRa,rec8vUmvtfqm5T4Ya",
      "Startup in a word": "HR agent to help founders connect to top talents on LinkedIn",
      "Team Members": "rec0QhejQgLA8Fwhg,recSoqbOOhPAmI21u",
      "Traction Summary": "🚀 Traction summary\n- 5 paying customers (€6K ARR)\n- €109/month pricing, short sales cycle (within 1 week)\n- 1/3 conversion rate on outbound\n- Targeting €200k ARR by end of year\n\n✅ Customer Validation\n- pivoted from HR process optimization to hiring/sourcing solutions after 100+ interviews\n- Paying clients confirmed\n- Conversion funnel: 20 requests → 14 accepts → 4 replies → 1 client\n\n🛠️ Product\n- LinkedIn AI agent automating headhunting for founders\n- MVP live with Slack integration\n- Subscription model tested (€109/month)\n\n📌 Other\n- Feedback: clarify tagline, add demo video, show mechanics, integrate with HR tools",
      "Traction Summary old": "5 paying customers (€6K ARR), MVP live with LinkedIn AI agent, 65% reply rate, migrating manual clients, targeting €190K ARR by Sept.",
      "Weekly forms": "recwFm9F5xTMVJ2z8,rec5sINW4287g4gVB,recxW0UbwAm3xGJwP,recAWmIXG9ptQSN1i,recWbZndX822GO0e7,reccSqoI1Y42I1bbj,recEZQMXcbyCdrwX6,recp3mUR44k6k7oyQ,recfkw7YdMHsmhxcM,rec0XtEdKjudkaSSq,recD8nmUOxSgHkTeK"
    }
  },
  "recNCKA9PBFfUQm2u": {
    "createdTime": "2025-07-22T14:11:00.000Z",
    "fields": {
      "Active / inactive": "Selection Day No Go",
      "Pitch Sequence": "8",
      "Previous Decks": "[object Object]",
      "Startup": "ThirdPlace",
      "Startup Evaluation": "rec1y8YDR7ZJuaWJq,recijJyn1blv65jlv,recZohkFrINFSaJdi,recbBVm0gxmdyQ2II",
      "Startup in a word": "The AI social compass matching you to your people AND your plans.",
      "Team Members": "recibD5fOJHhEU7FZ"
    }
  },
  "recQpVpn9qPUBTeJi": {
    "createdTime": "2025-07-17T09:52:26.000Z",
    "fields": {
      "Committee": "No",
      "Detailed Progress": "📅 Progress Timeline\n\n👥 Jul 5 – Team Formation\n\n- Amit + Alin (both ex Antler), product/GTM role split\n\n\n🛠️ Aug 5 – Office Hours\n\n- Learning: too early for big enterprise → focusing on startup-scale customers\n\n- Target: 3 more LOIs by IC\n\n- Introduced quantified outreach funnel (daily tracking)\n\n\n🎤 Aug 8 – Pitch\n\n- Position: AI for incident alert prioritization\n\n- Progress: 2 LOIs converting into pilots, MVP planned for Aug 15\n\n- Feedback: strong problem validation, but need startup case studies before enterprise\n\n\n🛠️ Aug 12 – Office Hours\n\n- Pilot engagement inconsistent (slow responses)\n\n- Product launch set for Aug 15 → plan to release even if incomplete\n\n- Pipeline weaker than expected, demos too basic\n\n- New outreach: multi-platform + automated campaigns\n\n- Validation strong: incident remediation pain resonates\n\n\n🎤 Aug 15 – Pitch\n\n- Launched 5,000-lead cold email campaign\n\n- MVP delayed to Aug 18 after customer feedback\n\n- Progress with design partners, but pitch flagged as low-energy/unfocused\n\n- Feedback: must streamline GTM strategy, avoid showing zero metrics\n\n\n🛠️ Aug 19 – Office Hours\n\n- Major changes required:\n• Clarify title (“Helping developers resolve incidents faster”)\n• Simplify problem slide with big numbers\n• Avoid jargon (e.g. MTTR)\n• Boost team credibility (roles + €350K saved in 20 min at Zalando example)\n• Design cleanup across slides\n\n\n🎤 Aug 22 – Pitch\n\n- Progress: 2 active customers, MVP nearly ready\n\n- Presentation stronger, with use case examples\n\n- Still too many unproven GTM channels\n\n- Problem slide too text-heavy\n\n- Feedback: traction credible, but story must highlight €10M+ savings + 1000+ incidents solved\n\n\n🎤 Aug 29 – Pitch\n\n- Progress: 2 signed customers + 1 new Amsterdam client\n\n- Solution framed as AI copilot aggregating monitoring data + generating insights\n\n- GTM: targeting startups via CTO network (500+)\n\n- Feedback (Salomon): problem real but story not “sexy”; must show differentiation vs Monte Carlo earlier",
      "Detailed Progress old": "Jul 5: Team formed. Amit and Alin (ex-Antler) partnered quickly, splitting roles between product and go-to-market. Early traction: 2 LOIs with active engagement, prospects integrated into Slack channels. Learning: too early for big enterprise, focusing on startup-scale customers.\n\nAug 5: Office hours. Team targeting 3 more LOIs by IC. Quantified outreach process introduced (daily outreach funnel tracking). Public LinkedIn posting approved to build awareness in developer communities. Product MVP targeted for first pilots.\n\nAug 8: Friday pitch positioned Orchly as AI for incident alert prioritization. Progress: 2 LOIs converting into pilots, first version planned for Aug 15. Feedback: strong problem validation but need startup case studies before selling into enterprise.\n\nAug 12: Office hours. Pilot customer engagement inconsistent (slow responses). Product launch set for Aug 15 — plan to release even if incomplete. Pipeline weaker than expected; demo quality too basic. Team launching multi-platform outreach, planning automated campaigns. Validation remains strong: incident remediation pain clearly resonates.\n\nAug 15: Pitch. 5,000-lead cold email campaign launched. MVP delayed to Aug 18 after customer feedback. Progress with design partners but presentation flagged as low-energy and unfocused. Feedback: must streamline GTM strategy and avoid showing zero metrics.\n\nAug 19: Deck review session. Major changes required: clarify title (“Helping developers resolve incidents faster”), simplify problem slide with big numbers, avoid technical jargon like MTTR. Team slide needs credibility boost (specific roles, real incident savings, €350k in 20 min Zalando example). Design cleanup across slides.\n\nAug 22: Pitch. Progress: 2 active customers, MVP nearly ready. Team presenting stronger with use case examples. Still too many unproven GTM channels. Problem slide text-heavy. Feedback: traction credible but storytelling must highlight €10M+ savings from past work and 1000+ incidents solved.\n\nAug 29: Pitch. Progress: 2 signed customers + 1 new Amsterdam client. Team experience: 26+ years, 1000+ incidents solved, €10M+ revenue saved. Solution framed as AI copilot aggregating monitoring data and generating insights. GTM: starting with startups via CTO network (500+). Feedback from Salomon: problem real but story not “sexy”; must show differentiation vs Monte Carlo earlier.",
      "Full Notes (Office Hours + Friday Pitches)": "https://polar-scale-0bb.notion.site/Orchly-25e1466f886f80d891aae8afd64c0f82?source=copy_link",
      "Industry": "DevTools",
      "Maxime's Comment": "PROS:\n\nTEAM:\nExperienced team in the incident management space (ex-Zalando, ex-Rocket Internet).\nHighly technical team.\nGood communication with the Pioneers team.\n\nMARKET:\nVery \"techy\" problem to solve - if they succeed, the will achieve high defensibility.\n\nCONS:\n\nTEAM:\nCEO is a bad pitcher.\nLow sales skills. (both tech profiles)\n\nEXECUTION:\nLow traction (result of bad sales).\n\nMARKET:\nProblem is not validated today as a result of low traction.\n\n",
      "Notes": "recOkboFFbmyLHJwF,recywt1yp9U4FrwtP,recQ5KFWdAfx35uFw",
      "Pitch Sequence": "6",
      "Previous Decks": "[object Object]",
      "Startup": "Orchly",
      "Startup Evaluation": "reciGdrPCtlwqeH4i,reccUK4FkRvIiTUsX,rec7XkWugUJh5cetW,recj2RvVHkFl8Y0JP,recgtCTPDxjYBpJ2F,rec4W3UPdlb0XyuK9",
      "Startup in a word": "The DevOps copilot that resolves incidents in minutes",
      "Team Members": "recSt2IAYyrlpGH9W,recuCYxmlOQvGuFM1,rec2hx9iqGVaWlCXb",
      "Traction Summary": "🚀 Traction summary\n- 2 pilot customers live (Slack integrations)\n- 1 new client signed (Aug 29)\n- 5K cold emails sent to expand pipeline\n- MVP launched mid-August\n\n✅ Customer Validation\n- 2 pilots active with real Slack usage\n- Targeting startup customers first (enterprise too early)\n- Early traction credible, but customer engagement inconsistent\n\n🛠️ Product\n- MVP launched mid-August as AI copilot for incident alert prioritization, Slack integration\n- Aggregates monitoring data and generates actionable insights\n- Positioning requires clearer differentiation vs Monte Carlo and other competitors\n\n📌 Other\n- Feedback: strong technical validation, but storytelling “not sexy” enough; need startup case studies, simpler messaging, and sharper GTM focus",
      "Traction Summary old": "2 pilot customers (Slack integrations live), 1 new Amsterdam client signed, MVP launch mid-August, 5K cold emails sent, strong validation but GTM focus still fragmented.",
      "Weekly forms": "recrghQToSJLUOHIW,recw45jin20bJgFZA,recx3744yTjpcMyAK,recsn9EbVYWrZnEUo,recz1BxTWJAqeVJFC,recgOO2cZiGNsqBDs"
    }
  },
  "recS7bP4NjqRJZTzL": {
    "createdTime": "2025-07-17T10:51:18.000Z",
    "fields": {
      "Active / inactive": "Selection Day No Go",
      "Notes": "rec4P6Jj27erKJo6l",
      "Pitch Sequence": "2",
      "Previous Decks": "[object Object]",
      "Startup": "Revelio",
      "Startup Evaluation": "recU3cvJZ1lFEnS6a,reclxMR40bAj8zUOy,recjt9xl9stMRVdGz,recUWuAXxa04HDd1V,recSR5DDL86ujI6ad",
      "Startup in a word": "All-in one AI native compliance solution for fintech companies \n\nWIP landing: https://reveliolabs.app \n",
      "Team Members": "recKzegnxmXnG97za,recBWgYi1xhGj68c8",
      "Weekly forms": "rechcqg4PIq5RZnI8,recv4yqFryhwLUn5l,recPdpzIaEceh3ie5"
    }
  },
  "recTgFx0MhiR4iLBe": {
    "createdTime": "2025-07-17T10:25:45.000Z",
    "fields": {
      "Active / inactive": "Selection Day No Go",
      "Notes": "recubUG5n7Gza93lx,recQspTTkrTndfAnp,recJsbX6nfaGV14n3",
      "Pitch Sequence": "19",
      "Previous Decks": "[object Object]",
      "Startup": "Promptaize",
      "Startup Evaluation": "recz6zuff9Yxs597t",
      "Startup in a word": "Know your Brand positioning in LLM search results",
      "Team Members": "recUOW9AqiE1oDktb,recCocEOyZsVUCNn0",
      "Weekly forms": "recO5jTkLYp05ohLM,rec9HLfjGQWLXRmpd"
    }
  },
  "recY8mEu15qBkFKVJ": {
    "createdTime": "2025-09-03T12:57:22.000Z",
    "fields": {
      "Active / inactive": "active",
      "Committee": "Go",
      "Detailed Progress": "📅 Progress Timeline\n\n👥 Sep 8 – Pre-IC Pitch\n\nTeam presented Everest, an AI-powered property search assistant\n\nMarket: targeting €7B French real estate transaction market\n\nProduct: natural language interface for property search\n\nRoadmap: v0 testing Oct 2025, public launch 2026\n\nDistribution: partnerships with agent networks OP and Digital under discussion\n\nFeedback:\n• Strong concept and clear pain point\n• Needs sharper short-term milestones to complement long-term launch vision\n• Early validation via network partnerships critical for traction",
      "Industry": "PropTech",
      "Maxime's Comment": "PROS:\nVery experienced founder with 20+ years as Top executive (SeLoger, Dropbox)\nDeep sector knowledge and expertise\n\nCONS:\n\"Boomer\" mindset\nCTO not full-time\nCash-heavy project\nTough B2C play\nComplex market with strong incumbents",
      "Pitch Sequence": "7",
      "Previous Decks": "[object Object]",
      "Startup": "Everest (external)",
      "Startup in a word": "The next generation of intelligent real estate assistant",
      "Team Members": "recqPLbAOARWV9HSd,recMbngnFWzg7aMtb",
      "Traction Summary": "🚀 Traction summary\n\n- AI-powered property search with natural language interface\n- Targeting €7B French real estate transactions market\n- Partnerships in discussion with agent networks (OP, Digital)\n- v0 testing planned for Oct 2025, public launch in 2026\n\n✅ Customer Validation\n- Market pain confirmed: property search remains fragmented and inefficient\n- Partnerships identified as main entry channel\n\n🛠️ Product\n- AI assistant simplifying real estate search through natural language queries\n- Designed to reduce dependency on legacy classified platforms\n\n\n📌 Other\n- Feedback: promising long-term vision, but early stage with long runway before launch\n- Needs to define near-term milestones and early validation metrics\n- Strategy: leverage partnerships to secure initial supply before public rollout\n- CTO not full-time until early 2026"
    }
  },
  "reca19vBRUyvW3ti7": {
    "createdTime": "2025-07-28T13:18:37.000Z",
    "fields": {
      "Committee": "No",
      "Detailed Progress": "📅 Progress Timeline\n\n👥 Jul 25 – Team Formation\n\n- Zac (Good Legal – 48K users) partnered with Moussa (AI engineer)\n\nInitial idea: infrastructure API for AI agents → pivoted to lawyer-facing tools\n\n\n🎤 Aug 8 – Pitch\n\n- Problem: legal research chaos (10+ logins, 20+ tabs)\n\n- Solution: browser-controlling AI agent\n\n- Traction: 54 outreach emails (44% click rate), 1 waitlist signup, 60K-lawyer database available\n\n- Ambition: build 4 tools/month\n\n\n🎤 Aug 15 – Pitch\n\n- Reframed as “Stripe for legal research”, infra for AI agents by 2030\n\n- Progress: 6 waitlist signups, iterating on landing page\n\n- Feedback: strong founder credibility, but unclear positioning (prosumer vs infra); need sharper articulation of target customer\n\n\n🎤 Aug 22 – Pitch\n\n- MVP nearing launch\n\n- Positioning still too technical (“SERP Firecrawl API”), lacked lawyer connection\n\n- Learning: lawyers prefer immediate interaction via UI vs pure infra\n\n- MVP private beta scheduled for Monday\n\n\n🎤 Aug 29 – Pitch\n\n- Progress: 7 tools launched\n\n- Signed design partnership with established legal publisher (founded 1612): €30K creation fee + €10K/year maintenance (credit-sharing model)\n\n- Market: €850B legal tooling, dominated by human effort\n\n- Feedback (Salomon): strong pain/solution framing + vision, but slides need stronger visuals for investor impact",
      "Detailed Progress old": "Jul 25: Team formed. Zac (founder of Good Legal with 48K users) partnered with Moussa (AI engineer). Initial idea: infrastructure API for AI agents, later pivoted to lawyer-facing tools.\n\nAug 8: First pitch. Problem framed as legal research chaos (10+ logins, 20+ tabs). Solution: browser-controlling AI agent. Early traction: 54 outreach emails (44% click rate), 1 waitlist signup, 60k lawyer database available. Ambition: build 4 tools/month.\n\nAug 15: Pitch. Reframed as “Stripe for legal research,” emphasizing infrastructure for AI agents by 2030. Progress: 6 waitlist signups, iterating on landing page. Strong founder credibility noted, but product positioning unclear (prosumer vs infrastructure). Feedback: need sharper articulation of target customer and approach.\n\nAug 22: Pitch. MVP nearing launch. Positioning still too technical (“SERP Firecrawl API”) and lacked clear lawyer connection. Learning: lawyers want immediate interaction with a UI, not just infrastructure. MVP private beta scheduled for Monday.\n\nAug 29: Pitch. Progress: 7 tools launched, background credibility with 48K-user Good Legal. Signed design partnership with established legal publisher (founded 1612): €30k creation fee + €10k/year maintenance with credit-sharing model. Market framed as €850B legal tooling space, currently dominated by human effort. Feedback from Salomon: strong pain/solution framing, good vision, but slides need stronger visuals for investor impact.",
      "Full Notes (Office Hours + Friday Pitches)": "https://polar-scale-0bb.notion.site/LegaLabs-ex-Vindex-25e1466f886f80f58abce7629caab884?source=copy_link",
      "Industry": "LegalTech",
      "Maxime's Comment": "PROS:\n- CEO strong traction and high domain expertise in the legal sector (lawyer himself)\n- Forward thinking vision of the future of the industry\n- Shipping fast and working hard (working on weekends, and shipped 4 mvps in 4 weeks)\n\nCONS:\nUnstable & unpredictable CTO\nCEO not very confident\nUnclear roadmap\n\"Messy\" team (unorganized)",
      "Pitch Sequence": "7",
      "Previous Decks": "[object Object]",
      "Startup": "LegaLabs (ex Vindex)",
      "Startup Evaluation": "recFyvvavuu7mK8vB,recO4yzeiKK3pnV3L,recoh6jGlhimRJ2cv,recQJJbclmpT50sDg,recQTZjFg9Q5ZzvOQ,recvwefaaox8RPm7d,recaIY3WC9faSLzdZ",
      "Startup in a word": "\"Stripe of legal knowledge\" - build the infrastructure for AI legal agents.\n",
      "Team Members": "recEOHF4Z0BmZq56C,recnO8Mn6MVb3cpzM",
      "Traction Summary": "🚀 Traction summary\n- MVP launched, 6 waitlist signups to date\n- Design partnership signed with legal publisher (€30K creation fee + €10K/year)\n- Founder credibility: built Good Legal to 48K users\n\n✅ Customer Validation\n- Early signups (6 on waitlist) show lawyer interest\n- Design partnership confirms B2B demand\n\n🛠️ Product\n- Pivoted from infrastructure API to lawyer-facing tools\n- Browser-controlling AI agent for legal research\n\n📌 Other\n- Feedback: strong founder credibility, but product positioning (prosumer vs infra) still lacks validation",
      "Traction Summary old": "48K-user founder background, MVP launched, 6 waitlist signups, design partnership with major legal publisher (€30k fee + €10k/year), pivoted from infrastructure API to lawyer-facing tools.",
      "Weekly forms": "recipes4yqaZrAcYm,recUQPR5gQCWZNtnE"
    }
  },
  "recfwAXL9FCSPpKdU": {
    "createdTime": "2025-07-17T11:01:02.000Z",
    "fields": {
      "Committee": "No",
      "Detailed Progress": "📅 Progress Timeline\n\n👥 Jul 8 – Team Formation\n\n- Barbara – ex-logistics startup founder, BD\n- Christian – CPO, leading freelancers\n\n- Focus: AI operational intelligence for logistics, starting with exception management (lost/missing parcels)\n\n- Early traction: landing page live, LOI with Govara (Turkish logistics player, also potential investor)\n\n\n🛠️ Aug 6 – Office Hours\n\n- Product ~70% complete: backend ready, email parser + WhatsApp integration working, dashboard in progress\n\n- LOI with Govara; founder’s prior company used as design partner\n\n- Weaknesses: limited visible traction, unclear speed of progress\n\n- Feedback: pitch too vague/generalist; needs tighter problem framing + single use case\n\n\n🎤 Aug 8 – Pitch\n\n- Position: AI operational intelligence for logistics\n\n- Progress: design partnership with Govara; DHL innovation team in pipeline (slow due to vacations)\n\n- Exploring accounting firms as distribution partners\n\n- Tech ~70% complete; launch targeted end of month\n\n\n🛠️ Aug 13 – Office Hours\n\n- MVP timeline unchanged: end of month\n\n- Development accelerated with AI tools\n\n- Sales pipeline: 15–20 daily personalized emails (via Crunchbase Premium)\n\n- Positioning refined to exception management (lost/missing parcels)\n\n- Feedback: need stronger storytelling; avoid “dashboard that does everything”\n\n\n🎤 Aug 15 – Pitch\n\n- Progress: 3 LOIs signed incl. Tesco (paying customer funding MVP)\n\n- Targeting €200M embedded analytics market in Europe\n\n- MVP launch set for Sept 1\n\n- Feedback: presentation too wordy + low-energy; integration with legacy logistics systems questioned\n\n\n🎤 Aug 22 – Pitch\n\n- Team strengthened: Barbara + Christian (experience: 9+ products, Daimler Trucks)\n\n- Progress: 3 partners in discussions, high-level European executives engaged, MVP pre-launch prep underway\n\n- Technical milestones: ingestion layer, WhatsApp/CSV integration, dispatcher shift overview\n\n- Feedback: compelling team + problem framing, but still no traction metrics beyond LOIs",
      "Detailed Progress old": "Jul 8: Team formed. Pivoted from invoicing/claims idea to operational risk identification for logistics. Barbara (ex-logistics startup founder) leads BD, Christian (CPO) coordinating tech freelancers. Early traction: landing page live, LOI signed with Turkish company Govara (also potential investor).\n\nAug 6: Office hours. Product ~70% complete: backend ready, email parser & WhatsApp integration working, dashboard in progress. LOI with Turkish logistics player; founder’s prior company used as design partner. Weakness: limited visible traction, unclear progress speed. Pitch feedback: too vague and generalist, needs tighter problem framing and single use case.\n\nAug 8: Pitch. Positioned as AI operational intelligence platform for logistics. Progress: design partnership with Govara, DHL innovation team in pipeline (slow due to vacations). Exploring accounting firms as distribution partners. Tech ~70% complete, targeting end-of-month launch.\n\nAug 13: Office hours. MVP timeline unchanged (end of month). Development accelerated using AI tools. Sales pipeline: 15–20 daily personalized emails launched via Crunchbase Premium. Positioning refined to focus on exception management (lost/missing parcels). Feedback: storytelling needed, avoid “dashboard that does everything.”\n\nAug 15: Pitch. Progress: 3 LOIs signed, incl. Tesco (paying customer funding MVP). Targeting €200M embedded analytics market in Europe. MVP launch set for Sept 1. Feedback: presentation too wordy and low-energy; integration with legacy logistics systems questioned.\n\nAug 22: Pitch. Team strengthened: Barbara + Christian (9+ products, Daimler Trucks). Progress: 3 partners in discussions, high-level European executives engaged, MVP pre-launch prep underway. Technical milestones: ingestion layer, WhatsApp/CSV integration, dispatcher shift overview. Feedback: compelling team + problem framing, but still needs traction metrics beyond LOIs.",
      "Full Notes (Office Hours + Friday Pitches)": "https://polar-scale-0bb.notion.site/Certin-25e1466f886f80d69b00f2c6ee0463fa?source=copy_link",
      "Industry": "Logistics",
      "Maxime's Comment": "PROS:\nStrong team: Both CEO and CTO have strong industry expertise in logistics\nCTO: Great communicator and pitcher\nFirst pilot with Turkish Logistics company\nGood network in the industry\n\nCONS:\nUnreliable CEO - commitment issues\nUnclear progress\nNo unique insight/differentiator",
      "Notes": "recj425iVHvKyQd7r",
      "Pitch Sequence": "9",
      "Previous Decks": "[object Object]",
      "Startup": "Certin",
      "Startup Evaluation": "recV7UVRk9wH65bcc,recUA1PMC3tXx4IRx,rec7kDkpXDnqshR9s,recrQc2Z1VxF3D2Iz,recFj8EAEpIHw8s1V,recBqFtfngCZHebef,recg5YIRCiYmu4xTQ",
      "Startup in a word": "Operational Intelligence for Modern Logistics\n\nOps teams in logistics are overwhelmed and drowning in scattered data between WhatsApp, spreadsheets, emails, and siloed systems. \nCertin is building an AI platform that analyzes operational data, detects SLA risks early, and automates workflows",
      "Team Members": "recLUoF1qWfeco20K,rec561LyNaAksEZPi",
      "Traction Summary": "🚀 Traction summary\n- 3 LOIs signed, including Tesco (paying MVP)\n- MVP launch planned for Sept 1\n- Target: 10 LOIs and 5 paying customers by IC\n\n✅ Customer Validation\n- LOIs secured with Turkish logistics firm (also potential investor) and Tesco\n- DHL innovation team in pipeline; high-level execs engaged\n\n🛠️ Product\n- MVP ~70% complete in mid-August: backend + email parser + WhatsApp integration working, dashboard in progress\n- MVP launch Sept 1\n- Focused use case: logistics exception management (lost/missing parcels)\n\n📌 Other\n- Feedback: avoid overly generalist framing, clarify integrations with legacy logistics systems",
      "Traction Summary old": "3 LOIs signed (incl. Tesco paying MVP funder), MVP launch Sept 1, pipeline of European logistics execs, targeting 10 LOIs and 5 paying customers by IC.",
      "Weekly forms": "recxBxbUT5vD6VwFN,recPik057MUsfQVHE,recW3Gw0G8PXzp0Jo,recfzatyC6Dt3A4ds,recry6lHPEYDQYFkN,recxL40p174LNTisQ"
    }
  },
  "recgcfQoyVJ6vQcOv": {
    "createdTime": "2025-06-27T14:48:10.000Z",
    "fields": {
      "Active / inactive": "dead",
      "Notes": "reci2cnBtnoslYviD,rec3buS9i1pCODN3W",
      "Startup": "Invest'Her",
      "Startup in a word": "Empowering women to manage their finances and engage in financial investing",
      "Team Members": "recSr6YEhbB1B1OSY,recHBTI1ypAieclDf",
      "Weekly forms": "reca2V92qlGSbzKp7,rec9LENDaTDJvNbEV"
    }
  },
  "rechY9RpaTtX4jAW5": {
    "createdTime": "2025-06-27T14:27:50.000Z",
    "fields": {
      "Active / inactive": "Selection Day No Go",
      "Main SU 2025 (2)": "Oudavone Surot, Thomas Martin",
      "Notes": "reckVBbh7dD6ndHnw,recOALQWjnYrJzWVk,recHYIBx0JnnCOVZL,rec7zvLBmytD2Dy8B,recCyz96BdWMP0sUl",
      "Pitch Sequence": "16",
      "Previous Decks": "[object Object]",
      "Startup": "GoFusion",
      "Startup Evaluation": "reckoUnKrFbLfR33I,rec7d5u2k3jf65ToR,reczzuxxUOxyH58XC,recEjlzu6JEDuHGsg,recGDJSDsBHlVySa1",
      "Startup in a word": "Go Fusion is a gamified app that engages employees on health and climate issues through real-life challenges — personalized to the company’s strategy, measurable, and motivating.\nPersonas: HR Directors, CSR Managers, Health & Safety Officers…",
      "Team Members": "recAPE9yt0iJZVBA0,rec1LGBT5rBulQ00D",
      "Weekly forms": "reccg9NK8gskAmYcZ,recTdlpoIEQu3odvb,recS5SS0LlhKj4iPQ,recg9Hwso7Rpd7ZDX"
    }
  },
  "recjkOOsE15ZOrrMN": {
    "createdTime": "2025-06-27T14:28:55.000Z",
    "fields": {
      "Notes": "recBpQTa4c0tbcSSa,recLwLXdAjq8xzz8z,rec0Cy5DnjWsR56bJ,recv3lS4DSfPsKjDb,recLIcylrSwzdzPBj,recieDoOjDov2Jo6D,recgHxssLG6RrHaqC,reclitNc3KZucyLFJ,rect9BkirK5w71kMK,recuUCg0lJc6gIU9Y,rec78CJ3vOSkDHuE6,recVnYbQSfBZ9dO08,reciBfSkPkTSpIr8D,reclVY2FjAtp6MyUd,recLnWSmGtduO4GzB,recZK7KdULWVVuJXC,recqND76a0Fmryu8r,rec18m36xxIjCMzDO,recDTJkNgKGrSxohq,rec8R7ggVbue246PA",
      "Startup": "Not in a team yet"
    }
  },
  "reck8wtLF8vPfrml3": {
    "createdTime": "2025-07-28T17:11:38.000Z",
    "fields": {
      "Active / inactive": "Selection Day No Go",
      "Pitch Sequence": "17",
      "Startup": "LeadCatAI",
      "Startup Evaluation": "recoHAduo2SQAaKlt,reccgCgRsZmFP8GNF,recuG9gx83NWXZ9Pp,recv3ttrbK1yaWPyD",
      "Startup in a word": "AI agents to find companies that want to buy your product",
      "Team Members": "rec2cIF9tr7DRPBKK"
    }
  },
  "recqqNkMnWZ5iRnnC": {
    "createdTime": "2025-07-28T13:18:07.000Z",
    "fields": {
      "Active / inactive": "Selection Day No Go",
      "Pitch Sequence": "10",
      "Previous Decks": "[object Object]",
      "Startup": "AdaLove",
      "Startup Evaluation": "recf0BAdOktas2EcP,rec5sk4YWuwIQ0buB,recqdl0O8zx8FZ6QS,recfY7QqvdVzeujJ0,recJHQovO6tzE0cmV",
      "Startup in a word": "The AI financial advisor designed by and for women",
      "Team Members": "recSr6YEhbB1B1OSY"
    }
  },
  "recrvuP1aF4gcmOGR": {
    "createdTime": "2025-06-27T14:28:16.000Z",
    "fields": {
      "Active / inactive": "active",
      "Committee": "Go",
      "Detailed Progress": "📅 Progress Timeline\n\n👥 Jun 17 – Team Formation\n\n- Maria (PhD in AI/NLP) + Alex (B2B entrepreneur)\n\n- Initial focus: large B2B companies with legal approval delays\n\n\n🛠️ Aug 4 – Office Hours\n\n- Product v1 ~2–3 weeks from launch\n\n- Focus clarified: contract-heavy industrial players (500+ employees, Europe)\n\n- Goal: sign 1 more pilot by end of August\n\n\n🎤 Aug 8 – Pitch\n\n- Alstom demo scheduled, Odoo meeting secured\n\n- Strong tech progress but bug in contract history management\n\n\n🛠️ Aug 11 – Office Hours\n\n- Alstom less suitable (public procurement focus)\n\n- Sales strategy pivot: angels → direct prospect outreach using advice-seeking approach\n\n- SaaS identified as promising ICP; building list of 60+ targets\n\n- Pipeline goal: 3–4 pilots (2 minimum acceptable)\n\n\n🎤 Aug 15 – Pitch\n\n- Emphasis: AI solution for repetitive legal reviews\n\n- Progress: 1 pilot signed with Hitachi, demo scheduled with Alstom VP Legal, strong interest from Coface & CEVA\n\n- Goal: 1 more LOI + 5 new companies contacted\n\n- Feedback: GTM too broad; unclear organizational behavior change required\n\n\n🛠️ Aug 18 – Office Hours \n\nFeedback:\n• Tagline too vague\n• Problem framing needs specificity (3–4 week delays)\n• Slides lacked text hierarchy\n• Recommendation: start with team slide for credibility\n\n\n🎤 Aug 22 – Pitch\n\n- 50+ interviews\n\n- Signed €15K paid pilot with Hitachi\n\n- Ongoing discussions: Alstom, Odoo\n\n- Feedback: better clarity, but missing competitor landscape & distribution strategy\n\n\n🎤 Aug 29 – Pitch\n\n- Progress: 50+ interviews, €15K Hitachi pilot confirmed\n\n- Ongoing discussions: Alstom, Coface, CEVA\n\nFeedback (Salomon):\n• Strong pain point identification\n• Questions on technical integration\n• Reliance on past approvals for high-budget decisions\n• ACV pricing justification (€50–100K)\n\n\n🎤 Sep 8 – Pre-IC Pitch\n\n- Position: AI platform to streamline legal workflows and reduce approval bottlenecks\n\n- Traction: €15K pilot with Hitachi, strong enterprise interest (Alstom, Coface, CEVA)\n\n- Validation: clear pain point – 3–4 week contract approval delays\n\n- Revenue model: targeting €100K pre-seed through pilot scaling\n\nFeedback:\n• Solid product solving real bottleneck, but concerns on market timing and competitive differentiation\n• Must refine competitor landscape and sharpen differentiation",
      "Detailed Progress old": "Jun 17: Team formed (Maria – PhD in AI/NLP, Alex – B2B entrepreneur). Targeting large B2B companies struggling with legal approval delays.\n\nAug 4: Product v1 ~2–3 weeks from launch. Hitachi pilot nearly ready. Market focus clarified: contract-heavy industrial players (500+ employees, Europe). Sales pipeline built with color-coded stages; first goal set to sign an additional pilot by end of August.\n\nAug 8: Pitch framed around removing 80% of legal bottlenecks. Alstom demo scheduled; Odoo meeting secured. Strong technical progress, but faced contract history management bug.\n\nAug 11: Alstom less suitable (public procurement focus). Maria advanced on core feature but still battling bugs. Sales strategy pivot: from angels to direct prospect outreach using “advice-seeking” approach. Identified SaaS companies as a promising new ICP, building list of 60+ targets. Discussion on stealth mode vs launching basic website. Pipeline: aiming for 3–4 pilots, 2 minimum acceptable.\n\nAug 15: Friday pitch emphasized AI solution for repetitive legal reviews. Progress: 1 pilot signed with Hitachi, demo scheduled with Alstom VP Legal, strong interest from Coface & CEVA. Goal: 1 more LOI + 5 new companies contacted. Feedback: go-to-market too broad, unclear on organizational behavior change required.\n\nAug 18: Deck review for IC prep. Feedback: tagline too vague, problem framing needs specificity (3–4 week delays in B2B context), slides lacked text hierarchy. Recommendation: start with team slide for credibility. Both Salomon & Bruno will be voting at IC.\n\nAug 22: Clearer pitch delivered. 50+ interviews since May. €15K paid pilot signed with Hitachi. Alstom and Odoo discussions ongoing. Feedback: stronger clarity vs previous weeks, but competitor landscape and distribution strategy still missing.\n\nAug 29: Team presented refined version. Progress: 50+ interviews, €15K pilot with Hitachi. Ongoing discussions with Alstom, Coface, and CEVA. Salomon feedback: strong pain point identification, but questions on technical integration, reliance on past approvals for high-budget decisions, and ACV pricing justification (€50–100k).",
      "Full Notes (Office Hours + Friday Pitches)": "https://polar-scale-0bb.notion.site/Mirmi-25e1466f886f800e8fa6f6e8f6bc5901?source=copy_link",
      "Industry": "LegalTech",
      "Main SU 2025 (2)": "Alex Hayem, Mariya Borovikova",
      "Maxime's Comment": "PROS:\n\nTEAM:\nThe team has a quality CTO with a PhD in Machine Learning.\nGreat pitching clarity.\n\nEXECUTION:\nGood Sales dynamic with advanced discussions with several entreprise clients with resulted in a signed 15k EUR Pilot with Hitachi.\n\n\nCONS:\nThe CEO has weak soft skills and is never on-site.\n",
      "Notes": "recm1t1fMB8nLJaCj,recDOwRUu5nHohVWq,recF5eqT57QheaA4F",
      "Pitch Sequence": "5",
      "Previous Decks": "[object Object]",
      "Startup": "Mirmi",
      "Startup Evaluation": "recvJUsTVXq9E84sK,recNbPjkX3F7tAQnI,recZD7VdPTkVUHHRa,recNiFyE0s8yHlC6X,recHjyvAYl2C6SL4F,rec306dGbH4RKgoEP",
      "Startup in a word": "The AI that knows your internal legal rules",
      "Team Members": "recHx5khDcNw6mQJU,recuqVu5yHzofeALq",
      "Traction Summary": "🚀 Traction summary\n- €15K paid pilot signed with Hitachi\n- Advanced talks with Alstom, Coface, CEVA\n- Target: 1 more pilot in September\n\n✅ Customer Validation\n- 50+ interviews with legal and procurement teams\n- Identified SaaS companies as promising ICP (60+ targets)\n\n🛠️ Product\n- v1 product ~2–3 weeks from launch (as of early August)\n- Core feature in progress; resolving contract history bug\n- AI solution automates repetitive legal reviews, cutting approval delays by up to 80%\n\n\n📌 Other\n- Feedback: clarify problem framing (3–4 week approval delays), refine competitor landscape & ACV pricing (€50–100K)\n- Concerns raised on market timing and competitive differentiation",
      "Traction Summary old": "50+ interviews, €15K pilot signed with Hitachi, advanced talks with Alstom & Coface, aiming for 1 more pilot in September.",
      "Weekly forms": "recJZHMfEKLPBWsrO,recQTktWaUMQmV4gY,recA7eYx2ywIKYw7T,recTKy1vfI0V2O2R4,recF1oTvahPNjcrV2,recGiC7VTCooZuFlH,rec86LDwDl9eEtw2e"
    }
  },
  "recxTQWoeOvfbefXm": {
    "createdTime": "2025-06-27T14:58:13.000Z",
    "fields": {
      "Startup": "Pitch Day",
      "Weekly forms": "reccwfZKISJA0oOvn"
    }
  },
  "recytyNYmCLGxzIgt": {
    "createdTime": "2025-07-17T10:48:17.000Z",
    "fields": {
      "Active / inactive": "Selection Day No Go",
      "Notes": "rec9XMazjUKGK8Wki,recysEG7jGUmBobGM",
      "Pitch Sequence": "12",
      "Previous Decks": "[object Object]",
      "Startup": "Vuen AI",
      "Startup Evaluation": "rec4y9MA2Hc8mZqlp,recZ3vQ0hXzhuMOO2,recBExUmvD2AQVgmN,recdzkTawmI7sNAW1,rec8ZPVzTHlqxV2z3",
      "Startup in a word": "A framework to build and chain visual agents that see, reason, and act on screen interfaces Think LangChain for Visual Agents",
      "Team Members": "recmWjRA5A3dYT8P8,rec1jwsAl6dhrtLFz",
      "Weekly forms": "recdgnx0FAxKUSnzq,rec8IxUgoCGCuFrR7,recXo3qSKutoVqs9E"
    }
  },
  "reczBZLnrTPQVYfu0": {
    "createdTime": "2025-06-27T14:27:01.000Z",
    "fields": {
      "Active / inactive": "active",
      "Committee": "Go",
      "Detailed Progress": "📅 Progress Timeline\n\n👥 Jun 20 – Team Formation\n\n- Vision: AI assistant to automate communication + coordination for Airbnb/Booking managers\n\n\n🛠️ Aug 4 – Office Hours\n\n- Focus: converting free → paid users\n\n- Booking integration delayed but top priority\n\n- Lead magnet campaign launched for past Airbnb testers\n\n- Cold calls + LinkedIn outreach driving steady sign-ups\n\n- Goal: 1,000 listings by Selection Day\n\n\n🎤 Aug 8 – Pitch\n\nPositioned as 8x cheaper than manual concierges (€60K/year savings for 40 listings)\n\nProgress: partnership with Keynes (smart locks), outreach to larger property managers\n\nTech blocker: not yet live on Booking → slowing growth\n\n\n🛠️ Aug 11 – Office Hours\n\n- Booking integration delayed again, blocking conversions\n\n- Landing page upgraded with video guides + FAQs\n\n- Outreach: 7 new sign-ups (5 via cold calls, 20 via automated campaigns)\n\n- Learning: engaged clients push product forward; silent clients churn\n\n- Need: automated customer issue-tracking system\n\n\n🎤 Aug 15 – Pitch\n\n- Reported €650 MRR, targeting €800 next week\n\n- Partnership: Key Nest (hardware lock partner)\n\n- Clients highly value analytics features\n\n- Feedback: pitch missing long-term vision beyond chatbot + €25/listing model\n\n- Next focus: automate support, stabilize Booking integration, explore UK\n\n\n🎤 Aug 22 – Pitch\n\n- Strong traction: €2K MRR, 78% post-demo conversion, zero churn, +5 clients/week\n\n- Signed Flex Living (700 listings, 3-year partner) + domotics partnerships\n\n- Expanded into Italy + Spain\n\n- Feedback: highlight zero churn + multi-platform coverage; add market growth data\n\n\n🎤 Aug 29 – Pitch\n\n- Progress: 35 customers, 800 listings, €2K MRR\n\n- Solution: AI co-pilot for communication, reviews, scheduling, staff coordination across Airbnb, Booking, WhatsApp, calls, texts\n\n- Feedback (Salomon): strong PMF + sticky model, but missing roadmap from €2K MRR → €100K ARR + competitive landscape\n\n\n🎤 Sep 8 – Pre-IC Pitch\n\n- Position: AI operations manager for short-term rental hosts\n\n- Traction: 12 paying customers, €36k ARR, 840 hours of workforce saved\n\n- Pricing: €25/listing model, early tests at €10/listing\n\n- Value: boost host margins from 10% to 40%\n\n- Team: strong background in hospitality industry\n\n- Feedback:\n• Competitors like Guesty face technical debt slowing AI adoption\n• Must refine roadmap to €100K ARR and highlight competitive edge\n• GTM focus on Europe via database-driven email + WhatsApp campaigns",
      "Detailed Progress old": "Jun 20: Team formed. Vision: AI assistant to automate communication and coordination for short-term rental managers (Airbnb/Booking).\n\nAug 4: Focus on converting free users to paid. Booking integration causing delays but prioritized for rollout. Lead magnet campaign for past Airbnb testers launched. Cold calls and LinkedIn outreach bringing steady sign-ups. Milestone goal: 1,000 listings by Selection Day.\n\nAug 8: Pitch positioned Ava as 8x cheaper than manual concierges (€60k/year savings for 40 listings). Progress: partnership with Keynes (smart locks), outreach to larger property managers. Technical blocker: still not live on Booking, slowing growth.\n\nAug 11: Booking integration release delayed again, blocking paid conversions. Landing page upgraded with video guides and FAQs. Outreach yielding 7 new sign-ups this week (5 from cold calls, 20 from automated campaigns). Learning: engaged clients drive product forward, silent clients often churn. Need automated customer issue-tracking database.\n\nAug 15: Reported €650 MRR, targeting €800 next week. Partnership agreed with Key Nest (hardware lock partner). Clients highly value analytics features. Pitch feedback: missing long-term vision beyond current chatbot and €25/listing model. Next focus: automate support, stabilize Booking integration, explore UK market.\n\nAug 22: Strong traction: €2K MRR, 78% post-demo conversion, zero churn, 5 new clients/week. Signed Flex Living (700 listings, 3-year partner) and other domotics partnerships. Expanded into Italy/Spain. Feedback: highlight zero churn and multi-platform coverage; add market growth data.\n\nAug 29: Reported 35 customers, 800 listings, €2K MRR. Solution positioned as AI co-pilot covering communication, reviews, scheduling, and staff coordination across Airbnb, Booking, WhatsApp, calls, and texts. Feedback from Salomon: strong product-market fit and sticky model, but missing roadmap from €2K MRR to €100K ARR and competitive landscape.",
      "Full Notes (Office Hours + Friday Pitches)": "https://polar-scale-0bb.notion.site/AvaHome-25e1466f886f80f59e1ce873e4c574f3?source=copy_link",
      "Industry": "PropTech",
      "Main SU 2025 (2)": " Simon Bigot, Alan Chevillard",
      "Maxime's Comment": "PROS:\n\nTEAM:\nBy far the most hardworking and consistent team (always the earliest team in the office and last to leave).\nThe only team that share their weekly updates without reminders.\nGreat synergy - They are aligned on the vision and they get along very well.\n\nEXECUTION:\nHigh shipping velocity: they have launched over 70 features in 3 months after constant contact with customers.\nGood traction: they've acquired 45 users, on 750 listings, and 3k MRR in less than 3 months.\n\n\nCONS:\nComplex market to achieve fast growth.\nUnclear path to billion dollar business.",
      "Notes": "recFveYZsR1G21ogm,rec7DIK3zeyZR36EX,rec31xgqiVtR8oVd4,recUnrqeQ7EnRfpTm,rec9BvF5BXw7iSEc5,recJawHLVVMBXAbz1",
      "Pitch Sequence": "4",
      "Previous Decks": "[object Object]",
      "Startup": "AvaHome",
      "Startup Evaluation": "recG8Ae484qc8mX1q,rec9vifNJxAnj4pCK,recZB2UqxFJRaFopz,rechCvtPbLZPH6HYA,rec4XgcNQYXEwAEOb,rec9ZvHK1WNgL6ORI,recT4aHWus4SQqoQT",
      "Startup in a word": "The AI Host for Short-Term Rentals",
      "Team Members": "rectONLC61YtJmvN0,recECVBmDnBzslgbO",
      "Traction Summary": "🚀 Traction summary\n- 12 paying customers, €36k ARR\n- 840 hours of workforce saved\n- €25/listing pricing model, targeting 100-property managers globally\n- Signed partnership with Flex Living (700 listings, 3-year deal)\n\n✅ Customer Validation\n- High conversion rate (78–80%) from demo to paid\n- Zero churn across customer base\n- Customers highly value analytics features and AI-driven coordination\n\n🛠️ Product\n- AI co-pilot for rental managers: handles communication, reviews, scheduling, and staff coordination\n- Multi-platform coverage: Airbnb, Booking (integration delays), WhatsApp, calls, texts\n- €25/listing subscription model; MRR growing steadily\n\n📌 Other\n- Strong founding team with hospitality industry background\n- Feedback: show roadmap to €100K ARR, add competitive landscape and market growth data\n- Competition: incumbents (e.g. Guesty) have technical debt slowing AI adoption",
      "Traction Summary old": "35 customers, 800 listings, €2K MRR, 78–80% post-demo conversion, zero churn, signed Flex Living partnership, expanding in EU (Italy/Spain).",
      "Weekly forms": "reczuqbva8T3SNYVS,recSB7aTeA6wWMBbK,recHJGpVbq74GqabR,recQmFnc4EMd5IYea,recXFdvpBJ9PcySrx,rec2BkTIfr7SEfKxq,recF53NTXffslRCKx,recM3ZbmDRgp7ykfH,recodtZ2lVGFuqEEk,recHqVvZ8flDXWH1s"
    }
  }
}